``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # openstack_blockstorage_volume_v2.anup-vol will be created
  + resource "openstack_blockstorage_volume_v2" "anup-vol" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for anup VM"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = (known after apply)
      + region            = (known after apply)
      + size              = 500
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.anup will be created
  + resource "openstack_compute_instance_v2" "anup" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c36m100"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "8cb91057-3b15-40b4-a366-cb87df584b87"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "Anup dedicated VM"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
        ]
      + stop_before_destroy = false
      + user_data           = "897b28439096037c0f0107c9a183f07b2d54f17f"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.celery[0] will be updated in-place
  ~ resource "openstack_compute_instance_v2" "celery" {
        id                  = "cbf3415b-25bb-4e44-b1b1-01cc9ea1400b"
        name                = "celery-0.galaxyproject.eu"
      ~ security_groups     = [
          - "ingress-from-proxy",
            # (1 unchanged element hidden)
        ]
        tags                = []
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # openstack_compute_volume_attach_v2.anup-va will be created
  + resource "openstack_compute_volume_attach_v2" "anup-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # random_id.anup-volume_name_unique will be created
  + resource "random_id" "anup-volume_name_unique" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```